# Module 1 - Manipulating data with Pandas
## Pandas Part 2

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)

## Scenario:
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. In this lecture, we are continue to look at a real data set collected by Austin Animal Center over several years and use our pandas skills from the last lecture and learn some new ones in order to explore this data further.

#### _Our goals today are to be able to_: <br/>

Use the pandas library to:

- Get summary info about a dataset and its variables
  - Apply and use info, describe and dtypes
  - Use mean, min, max, and value_counts 
- Use apply and applymap to transform columns and create new values

- Explain lambda functions and use them to use an apply on a DataFrame
- Explain what a groupby object is and split a DataFrame using a groupby
- Reshape a DataFrame using joins, merges, pivoting, stacking, and melting

## Getting started

Let's take a moment to examine the [Austin Animal Center data set](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Outcomes/9t4d-g238/data). What kinds of questions can we ask this data and what kinds of information can we get back?

In pairs and as a class, let's generate ideas.

## Switch gears

Before we answer those questions about the animal shelter data, let's practice on a simpler dataset.
Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci
![heart-data](images/heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### 1. Get summary info about a dataset and its variables

Applying and using `info`, `describe`, `mean`, `min`, `max`, `apply`, and `applymap` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [2]:
!pwd
!ls -al

/Users/angelmanzur/Code/FIS/dc_ds_04_22_19/module_1/day_4_lecture_1_manipulating_with_pandas
total 88
drwxr-xr-x   9 angelmanzur  staff    288 Apr 25 10:16 .
drwxr-xr-x  14 angelmanzur  staff    448 Apr 25 09:52 ..
drwxr-xr-x   3 angelmanzur  staff     96 Apr 25 10:16 .ipynb_checkpoints
-rw-r--r--   1 angelmanzur  staff     95 Apr 25 09:52 ds_chars.csv
-rw-r--r--   1 angelmanzur  staff  11328 Apr 25 09:52 heart.csv
drwxr-xr-x   4 angelmanzur  staff    128 Apr 25 09:52 images
-rw-r--r--   1 angelmanzur  staff  16603 Apr 25 09:56 manipulating_data_with_pandas.ipynb
-rw-r--r--   1 angelmanzur  staff   3297 Apr 25 09:52 pre_process_animal_shelter_data.py
-rw-r--r--   1 angelmanzur  staff    130 Apr 25 09:52 states.csv

In [3]:
import pandas as pd
uci = pd.read_csv('heart.csv')

In [4]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

#### The `.columns` and `.shape` Attributes

In [5]:
uci.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [8]:
uci.shape

(303, 14)

#### The `.info() `and `.describe()` and `.dtypes` methods

Pandas DataFrames have many useful methods! Let's look at `.info()` , `.describe()`, and `dtypes`.

In [13]:
# Call the .info() method on our dataset. What do you observe?

uci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
dtypes: float64(1), int64(13)
memory usage: 33.2 KB

In [10]:
# Call the .describe() method on our dataset. What do you observe?
uci.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [14]:
# Use the code below. How does the output differ from info() ?
uci.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

#### `.mean()`, .`min()`,` .max()`, `.sum()`

The methods `.mean()`, `.min()`, and `.max()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [16]:
uci['age'].mean()

54.366336633663366

#### The Axis Variable

In [17]:
uci.sum() # Try [shift] + [tab] here!

age         16473.0
sex           207.0
cp            293.0
trestbps    39882.0
chol        74618.0
fbs            45.0
restecg       160.0
thalach     45343.0
exang          99.0
oldpeak       315.0
slope         424.0
ca            221.0
thal          701.0
target        165.0
dtype: float64

In [20]:
uci.age.value_counts()[:10]

58    19
57    17
54    16
59    14
52    13
51    12
62    11
44    11
60    11
56    11
Name: age, dtype: int64

#### .`value_counts()`

For a DataFrame _Series_, the `.value_counts()` method will tell you how many of each value you've got.

In [ ]:
uci['age'].value_counts()[:10]

$\bf{\rightarrow Exercise: What\ are\ the\ different\ values\ for\ restecg?}$

In [21]:
# Your code here!
uci.restecg.value_counts()

1    152
0    147
2      4
Name: restecg, dtype: int64

### Apply to Animal Shelter Data
Using `.info()` and `.describe()` and `dtypes` what observations can we make about the data?

What are the breed value counts?

How about age counts for dogs?

In [73]:
animal_outcomes = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

In [74]:
animal_outcomes.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A792769,Pawd Father,04/25/2019 08:22:00 AM,04/25/2019 08:22:00 AM,04/15/2017,Return to Owner,NaN,Cat,Intact Male,2 years,Domestic Shorthair Mix,Black
1,A791077,*Archie,04/25/2019 08:07:00 AM,04/25/2019 08:07:00 AM,02/14/2019,Adoption,Foster,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Orange Tabby
2,A793392,NaN,04/24/2019 09:37:00 PM,04/24/2019 09:37:00 PM,04/22/2019,Transfer,Partner,Cat,Intact Male,2 days,Domestic Shorthair Mix,White/Black
3,A793417,Diamond,04/24/2019 07:04:00 PM,04/24/2019 07:04:00 PM,04/24/2018,Return to Owner,NaN,Dog,Spayed Female,1 year,Pit Bull Mix,Chocolate/White
4,A793087,*Jeepers,04/24/2019 07:04:00 PM,04/24/2019 07:04:00 PM,04/19/2017,Adoption,NaN,Dog,Neutered Male,2 years,Harrier Mix,Black/Tricolor

In [75]:
new_names = ['id', 'name', 'date', 'monthyear', 'dob', 'outcome', 'outcome_s', 'animal', 'sex', 'age', 'breed', 'color']

In [76]:
animal_outcomes.columns = new_names

In [77]:
animal_outcomes.head()

,id,name,date,monthyear,dob,outcome,outcome_s,animal,sex,age,breed,color
0,A792769,Pawd Father,04/25/2019 08:22:00 AM,04/25/2019 08:22:00 AM,04/15/2017,Return to Owner,NaN,Cat,Intact Male,2 years,Domestic Shorthair Mix,Black
1,A791077,*Archie,04/25/2019 08:07:00 AM,04/25/2019 08:07:00 AM,02/14/2019,Adoption,Foster,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Orange Tabby
2,A793392,NaN,04/24/2019 09:37:00 PM,04/24/2019 09:37:00 PM,04/22/2019,Transfer,Partner,Cat,Intact Male,2 days,Domestic Shorthair Mix,White/Black
3,A793417,Diamond,04/24/2019 07:04:00 PM,04/24/2019 07:04:00 PM,04/24/2018,Return to Owner,NaN,Dog,Spayed Female,1 year,Pit Bull Mix,Chocolate/White
4,A793087,*Jeepers,04/24/2019 07:04:00 PM,04/24/2019 07:04:00 PM,04/19/2017,Adoption,NaN,Dog,Neutered Male,2 years,Harrier Mix,Black/Tricolor

In [48]:
animal_outcomes.shape
animal_outcomes.dtypes

Animal ID           object
Name                object
DateTime            object
MonthYear           object
Date of Birth       object
Outcome Type        object
Outcome Subtype     object
Animal Type         object
Sex upon Outcome    object
Age upon Outcome    object
Breed               object
Color               object
dtype: object

In [23]:
# put your code here
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 98865 entries, 0 to 98864
Data columns (total 12 columns):
Animal ID           98865 non-null object
Name                68333 non-null object
DateTime            98865 non-null object
MonthYear           98865 non-null object
Date of Birth       98865 non-null object
Outcome Type        98856 non-null object
Outcome Subtype     44828 non-null object
Animal Type         98865 non-null object
Sex upon Outcome    98863 non-null object
Age upon Outcome    98862 non-null object
Breed               98865 non-null object
Color               98865 non-null object
dtypes: object(12)
memory usage: 9.1+ MB

In [33]:
animal_outcomes.Breed.value_counts()[:10]

Domestic Shorthair Mix       29090
Pit Bull Mix                  7738
Labrador Retriever Mix        5990
Chihuahua Shorthair Mix       5861
Domestic Medium Hair Mix      2935
German Shepherd Mix           2604
Bat Mix                       1735
Domestic Longhair Mix         1452
Australian Cattle Dog Mix     1315
Siamese Mix                   1160
Name: Breed, dtype: int64

In [39]:
animal_outcomes[
            (animal_outcomes['Animal Type']=='Dog') 
            & (animal_outcomes['Outcome Type']=='Adoption')
               ].Breed.value_counts()[:10]

Labrador Retriever Mix       3016
Pit Bull Mix                 2986
Chihuahua Shorthair Mix      2790
German Shepherd Mix          1315
Australian Cattle Dog Mix     735
Dachshund Mix                 465
Border Collie Mix             440
Boxer Mix                     389
Catahoula Mix                 324
Staffordshire Mix             315
Name: Breed, dtype: int64

In [43]:
animal_outcomes[animal_outcomes['Animal Type']=='Dog']['Outcome Type'].value_counts()[:10]

Adoption           26207
Return to Owner    16175
Transfer           12134
Euthanasia          1602
Rto-Adopt            302
Died                 192
Missing               20
Disposal              11
Name: Outcome Type, dtype: int64

In [50]:
animal_outcomes[
            (animal_outcomes['Animal Type']=='Bird') 
            & (animal_outcomes['Outcome Type']=='Adoption')
               ].Breed.value_counts()[:10]

Chicken Mix      57
Chicken          39
Parakeet Mix     20
Duck Mix          8
Cockatiel Mix     7
Parakeet          4
Peafowl Mix       4
Bantam Mix        4
Parrot Mix        3
Parrot            2
Name: Breed, dtype: int64

### 2.  Changing data

#### DataFrame.applymap() and Series.map()

The ```.applymap()``` method takes a function as input that it will then apply to every entry in the dataframe.

In [51]:
def successor(x):
    return x + 1

In [52]:
uci.applymap(successor).head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,64,2,4,146,234,2,1,151,1,3.3,1,1,2,2
1,38,2,3,131,251,1,2,188,1,4.5,1,1,3,2
2,42,1,2,131,205,1,1,173,1,2.4,3,1,3,2
3,57,2,2,121,237,1,2,179,1,1.8,3,1,3,2
4,58,1,1,121,355,1,2,164,2,1.6,3,1,3,2

The `.map()` method takes a function as input that it will then apply to every entry in the Series.

In [55]:
uci['age'].map(successor).tail(10)

293    68
294    45
295    64
296    64
297    60
298    58
299    46
300    69
301    58
302    58
Name: age, dtype: int64

#### Anonymous Functions (Lambda Abstraction)

Simple functions can be defined right in the function call. This is called 'lambda abstraction'; the function thus defined has no name and hence is "anonymous".

In [59]:
uci['oldpeak'].apply(lambda x: round(x))[:4]

0    2
1    4
2    1
3    1
Name: oldpeak, dtype: int64

$\bf{\rightarrow Exercise: Use\ an\ anonymous\ function\ to\ turn\ the\ entries\ in\ age\ to\ strings}$

In [79]:
# Your code here!
animal_outcomes.head(1)
animal_outcomes.date = animal_outcomes.date.map(lambda x: x[:10])

In [83]:
animal_outcomes['date'] = pd.to_datetime(animal_outcomes['date'], format='%m/%d/%Y')

In [86]:
animal_outcomes['dob'] = pd.to_datetime(animal_outcomes['dob'], format='%m/%d/%Y')

In [87]:
animal_outcomes.dtypes

id                   object
name                 object
date         datetime64[ns]
monthyear            object
dob          datetime64[ns]
outcome              object
outcome_s            object
animal               object
sex                  object
age                  object
breed                object
color                object
dtype: object

In [88]:
animal_outcomes['diff'] = animal_outcomes['date']- animal_outcomes['dob']

In [91]:
animal_outcomes.describe()

                            diff
count                      98867
mean    818 days 18:43:17.890094
std    1078 days 21:19:26.866969
min          -376 days +00:00:00
25%             96 days 00:00:00
50%            371 days 00:00:00
75%           1095 days 00:00:00
max           9137 days 00:00:00

In [94]:
animal_outcomes['diff'] = animal_outcomes['diff'].apply(lambda x: x.days/365)

In [96]:
animal_outcomes.head()

,id,name,date,monthyear,dob,outcome,outcome_s,animal,sex,age,breed,color,diff
0,A792769,Pawd Father,2019-04-25,04/25/2019 08:22:00 AM,2017-04-15,Return to Owner,NaN,Cat,Intact Male,2 years,Domestic Shorthair Mix,Black,2.027397
1,A791077,*Archie,2019-04-25,04/25/2019 08:07:00 AM,2019-02-14,Adoption,Foster,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Orange Tabby,0.191781
2,A793392,NaN,2019-04-24,04/24/2019 09:37:00 PM,2019-04-22,Transfer,Partner,Cat,Intact Male,2 days,Domestic Shorthair Mix,White/Black,0.005479
3,A793417,Diamond,2019-04-24,04/24/2019 07:04:00 PM,2018-04-24,Return to Owner,NaN,Dog,Spayed Female,1 year,Pit Bull Mix,Chocolate/White,1.000000
4,A793087,*Jeepers,2019-04-24,04/24/2019 07:04:00 PM,2017-04-19,Adoption,NaN,Dog,Neutered Male,2 years,Harrier Mix,Black/Tricolor,2.013699

### Apply to Animal Shelter Data

Use an `apply` to change the dates from strings to datetime objects. Similarly, use an apply to change the ages of the animals from strings to floats.

In [ ]:
# Your code here

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [99]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [100]:
uci.groupby('sex')

#### `.groups` and `.get_group()`

In [101]:
uci.groupby('sex').groups

{0: Int64Index([  2,   4,   6,  11,  14,  15,  16,  17,  19,  25,  28,  30,  35,
              36,  38,  39,  40,  43,  48,  49,  50,  53,  54,  59,  60,  65,
              67,  69,  74,  75,  82,  84,  85,  88,  89,  93,  94,  96, 102,
             105, 107, 108, 109, 110, 112, 115, 118, 119, 120, 122, 123, 124,
             125, 127, 128, 129, 130, 131, 134, 135, 136, 140, 142, 143, 144,
             146, 147, 151, 153, 154, 155, 161, 167, 181, 182, 190, 204, 207,
             213, 215, 216, 220, 223, 241, 246, 252, 258, 260, 263, 266, 278,
             289, 292, 296, 298, 302],
            dtype='int64'),
 1: Int64Index([  0,   1,   3,   5,   7,   8,   9,  10,  12,  13,
             ...
             288, 290, 291, 293, 294, 295, 297, 299, 300, 301],
            dtype='int64', length=207)}

In [104]:
uci.groupby('sex').get_group(1).head() # .tail()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
5,57,1,0,140,192,0,1,148,0,0.4,1,0,1,1
7,44,1,1,120,263,0,1,173,0,0.0,2,0,3,1

### Aggregating

In [106]:
uci.groupby('sex').mean()

,age,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
sex,,,,,,,,,,,,,
0,55.677083,1.041667,133.083333,261.302083,0.12500,0.572917,151.125000,0.229167,0.876042,1.427083,0.552083,2.125000,0.750000
1,53.758454,0.932367,130.946860,239.289855,0.15942,0.507246,148.961353,0.371981,1.115459,1.386473,0.811594,2.400966,0.449275

$\bf{\rightarrow Exercise: Tell\ me\ the\ average\ cholesterol\ level\ for\ those\ with\ heart\ disease.}$

In [ ]:
# Your code here!

### Apply to Animal Shelter Data

Lastly, use a groupby to show the average age of the different kinds of animal types. Hint: use `.unique()` on a column to see what unique values are in the column.

In [ ]:
# Your code here

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [107]:
uci.pivot(values = 'sex', columns = 'target').tail(10)

target    0   1
293     1.0 NaN
294     1.0 NaN
295     1.0 NaN
296     0.0 NaN
297     1.0 NaN
298     0.0 NaN
299     1.0 NaN
300     1.0 NaN
301     1.0 NaN
302     0.0 NaN

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

### `.join()`

In [ ]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns = ['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns = ['age', 'HP'])

In [ ]:
toy1.join(toy2.set_index('age'), on = 'age',
          lsuffix = '_A', rsuffix = '_B').head()

### `.merge()`

In [ ]:
ds_chars = pd.read_csv('ds_chars.csv', index_col = 0)

In [ ]:
states = pd.read_csv('states.csv', index_col = 0)

In [ ]:
ds_chars.merge(states, left_on='home_state', right_on = 'state',
               how = 'inner')

### `pd.concat()`

$\bf{\rightarrow Exercise: Look\ up\ the documentation\ on\ pd.concat}$ (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) $\bf{and\ use\ it\ to\ concatenate\ ds\_chars\ and\ states.}$
<br/>
$\bf{Your\ result\ should\ still\ have\ only\ five\ rows!}$

In [ ]:
pd.concat([ds_chars, states])

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [ ]:
pd.melt(ds_full, id_vars=)

## Bringing it all together with the Animal Shelter Data

Join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

The Url for the Intake Dataset is here: https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD

_Hints_ :
- import and clean the intake dataset first
- use apply/applymap/lambda to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new days-in-shelter variable
- Notice that some values in "days_in_shelter" column are NaN or values < 0 (remove these rows using the "<" operator and ~is.na())
- Use group_by to get some interesting information about the dataset

Make sure to export and save your cleaned dataset. We will use it in a later lecture!

use the notation `df.to_csv()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [ ]:
#code here

## Assessment & Reflection